# backtester	Тестирование стратегии на исторических данных.	
# Симуляция выполнения сделок. 
# Расчет метрик производительности (прибыльность, просадка, Sharpe Ratio).

# Логирование
# ====================================================
from src.utils.logger import get_logger
logger = get_logger(__name__)

from src.config.config import config

# точка входа для бэктестера
# ====================================================
def run_local_backtest():
    """Основной конвейер для получения и сохранения исторических данных по монетам из конфигурации."""

    # Получение настроек Биржи
    exchange_id = config.get_setting("EXCHANGE_SETTINGS", "EXCHANGE_ID")
    limit = config.get_setting("EXCHANGE_SETTINGS", "LIMIT")
    data_dir = config.get_setting("MODE_SETTINGS", "DATA_DIR")
    
    
    # 1. Получение массива монет
    try:
        coins_list = config.get_section("COINS")
        print(f"Загружено {len(coins_list)} монет из конфигурации.")
    except KeyError as e:
        # Хотя валидация должна была поймать это, это хорошая защита
        print(f"Критическая ошибка: {e}")
        coins_list = [] # Устанавливаем пустой список для безопасной работы
        
    # Подключение к Бирже
    from src.logical.data_fetcher.data_fetcher import DataFetcher
    # 2. Обработка каждой монеты   
    for coin in coins_list:
        logger.info("============================================================================")
        symbol = coin.get("SYMBOL")+"/USDT"
        timeframe = coin.get("TIMEFRAME")
        logger.info(f"Монета: {symbol}, Таймфрейм: {timeframe}")
        fetcher = DataFetcher( symbol, timeframe, exchange_id, limit)
        # 2. Загрузка из файла
        
        data_df = fetcher.load_from_csv(directory=data_dir+"csv_files", file_type="csv")
    
        if data_df is not None:
            logger.info(f"🚀 Запуск стратегии для {symbol} с локальными данными.")
            #  Здесь вы передаете data_df в ваш модуль стратегии или бэктестера
            # backtester.run(data_df)
        else:
            logger.error(f"Невозможно запустить бэктест для {symbol}: данные не загружены.")
        
        
def backtest_coin(coin_symbol: str, timeframe: str, file_path: str):
    """
    Запуск бэктеста с данными, загруженными из локального файла.
    """
    
    # 1. Инициализируем DataFetcher (хотя он не будет обращаться к бирже, 
    #    он нужен для использования метода load_from_csv)
    # Используем заглушечные параметры для биржи, так как они не важны
        # Подключение к Бирже
    from src.logical.data_fetcher.data_fetcher import DataFetcher
    
    fetcher = DataFetcher(symbol=coin_symbol, timeframe=timeframe, exchange_id="bybit", limit=1000)
    
    # 2. Загрузка из файла
    data_df = fetcher.load_from_csv(file_path)
    
    if data_df is not None:
        logger.info(f"🚀 Запуск стратегии для {coin_symbol} с локальными данными.")
        # Здесь вы передаете data_df в ваш модуль стратегии или бэктестера
        # backtester.run(data_df)
    else:
        logger.error(f"Невозможно запустить бэктест для {coin_symbol}: данные не загружены.")